eisup_2019_docmng_integration/src/Documents/ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО/ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО</name>
  <registerRecords>InformationRegister.ttk_СоответствиеКонтрагентовЕИСУПиВГО</registerRecords>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеКонтрагентов</name>
    <attributes>
      <name>КонтрагентЕИСУП</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорЕИСУП</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентВГО</name>
      <type>
        <types>CatalogRef.ttk_КонтрагентыВГО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абсСтатусыКонтрагентов/абсСтатусыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыКонтрагентов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>ЗавершениеОтношений</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПереутверждение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СменаРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйКонтроль</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПервичныхДокументов/абс_СтатусыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПервичныхДокументов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПринятыБухгалтером</name>
    <comment>Обработка принятых документов (до оптимизации 2018)</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>УточнениеОФК</name>
  </enumValues>
  <enumValues>
    <name>УточнениеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДокумента</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Источник</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Приемник</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДиректоромДирекции</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДанных</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДК</name>
    <comment>Департамент казначейства</comment>
  </enumValues>
  <enumValues>
    <name>СогласованиеОЭФ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомКЦ</name>
  </enumValues>
  <enumValues>
    <name>БюджетныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДД</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/ttk_КонтрагентыВГО/ttk_КонтрагентыВГО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ttk_КонтрагентыВГО</name>
  <attributes>
    <name>КодАСВГО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абсСтатусыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.ttk_КонтрагентыВГО</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Documents/ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьСоответствиеНаСервере()
	
	СписокСоответствия = Документы.ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО.ЗаполнитьСоответствиеКонтрагентовЕИСУПиВГО(Объект.Организация);
	СписокСоответствия.Свернуть("КонтрагентЕИСУП, ДоговорЕИСУП, КонтрагентВГО");
	Объект.СоответствиеКонтрагентов.Загрузить(СписокСоответствия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовПоРолямПользователя()
	
	мРолиПользователя = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(глЗначениеПеременной("глТекущийПользователь"));	
	
	Если мСтатус = ПредопределенноеЗначение("Перечисление.абсСтатусыКонтрагентов.Подготовка") Тогда
		УстановитьТолькоПросмотрВсемЭлементам(Ложь);
	Иначе
		Если мРолиПользователя.Найти(Справочники.РолиИсполнителей.СогласованиеБухгалтером) <> Неопределено Или мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь) <> Неопределено Тогда
			УстановитьТолькоПросмотрВсемЭлементам(Ложь);
		Иначе 
			УстановитьТолькоПросмотрВсемЭлементам(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьТолькоПросмотрВсемЭлементам(мТолькоПросмотр = Истина)

	Для Каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			Элемент.ТолькоПросмотр = мТолькоПросмотр;
		Исключение
			Элемент.Доступность = Не мТолькоПросмотр;						
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатусыДокументаНаСервере()

	Документы.ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО.ЗаполнитьСписокДоступныхСтатусов(Элементы.мСтатус.СписокВыбора, Объект.Ссылка);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыНаСервере()
	
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("Дт", ТекущаяДата());
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("СсылкаНаДокумент", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = (Параметры.Ключ.Пустая() И Параметры.ЗначениеКопирования.Пустая());
	ТолькоПросмотрЭлемента = Ложь;
	УстановитьПараметрыНаСервере();	
	Объект.Ответственный = ?(Не ЗначениеЗаполнено(Объект.Ответственный), глЗначениеПеременной("глТекущийПользователь"), Объект.Ответственный);
	Объект.Статус = ?(Не ЗначениеЗаполнено(Объект.Статус), Перечисления.абс_СтатусыПервичныхДокументов.Подготовка, Объект.Статус);
	
	Если Не (РольДоступна("АБС_Бухгалтер") Или РольДоступна("ПолныеПрава")) Тогда
		ТолькоПросмотрЭлемента = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСтатусыДокументаНаСервере();
	мСтатус = Объект.Статус;	
	УстановитьТолькоПросмотрВсемЭлементам(ТолькоПросмотрЭлемента);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	мСтатус = Объект.Статус;
	ОбновитьВидимостьЭлементовПоРолямПользователя();
	УстановитьПараметрыНаСервере();
	Элементы.ИсторияСогласования.Обновить();
	ЗаполнитьСтатусыДокументаНаСервере();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КонтрагентВГО", ПредопределенноеЗначение("Справочник.ttk_КонтрагентыВГО.ПустаяСсылка"));
	НайденныеСтроки = Объект.СоответствиеКонтрагентов.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Ответ = Вопрос("В таблице соответствия найдены строки с пустыми значениями 'Контрагент ВГО'. Продолжить запись документа?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если мСтатус <> Объект.Статус Тогда
		ПричинаИзмененияСтатуса = "";
		Если ВвестиСтроку(ПричинаИзмененияСтатуса, "Причина изменения статуса.", , Истина) Тогда
			Объект.ПричинаИзмененияСтатуса = ПричинаИзмененияСтатуса;
			Объект.Статус = мСтатус;
		Иначе
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.СоответствиеКонтрагентов.Количество() > 0 Тогда
		Ответ = Вопрос("Табличная часть документа будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СоответствиеКонтрагентов.Очистить();
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСоответствиеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеКонтрагентовКонтрагентВГОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ТекущийЭлемент.ТекущиеДанные.КонтрагентВГО) Тогда
		СтандартнаяОбработка = Ложь;	    	
    	ЗначениеОтбора = Новый Структура("ИНН", Элементы.СоответствиеКонтрагентов.ТекущиеДанные.КонтрагентЕИСУП.ИНН);
   		ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
    	ОткрытьФорму("Справочник.ttk_КонтрагентыВГО.ФормаВыбора", ПараметрыВыбора, Элемент);
   	КонецЕсли;
	
КонецПроцедуры
